Documents/ро_Реестры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ро_Реестры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РаботаРО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролерСТК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРеестра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрОтбораДляРеестра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФильтрыОтбораДляРеестра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БухРеализация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаказНаряды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаряд</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.роЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РучКорректировка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗаказНаряда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерОборудования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ппНомерОборудования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПараметров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заключение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_Заключения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Металлолом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаряд</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.роЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаботаПоПрайсу</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_РаботыПоПрайсу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_Работы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыДокументовДЛяПечФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДокументовДЛяПечФорм</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Все</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реестр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испытания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДефВедомость</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ро_Оборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ро_Оборудование</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодR3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диаметр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Давление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучКорДавления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХодШтока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПружины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Пружины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаГОСТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаДатаПрибора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтроительнаяДлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПечФорма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПечатныеФормы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьВДокументах</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДокументовДЛяПечФорм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаименованиеДляКонтрагента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеКА</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>222</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Дефектовка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Деталь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДеталиОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дефект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дефекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Годен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реставрация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изготовление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покупка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМаркаДетали</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ро_Реестры/Ext/ManagerModule.bsl
#Область Печать

Функция ДанныеШапка(ссДок)
	
	Стк = Новый Структура();
	
	Стк.Вставить("Дата",Формат(ссДок.Дата,"ДФ=dd.MM.yyyy"));
	Стк.Вставить("дтМес",Формат(ссДок.Дата,"ДФ='MMMM yyyy'"));
	
	
	Стк.Вставить("Номер",СокрЛП(ссДок.Номер));
	Стк.вставить("ФИООтв",Справочники.ФизическиеЛица.ФИОстр(ссДок.Ответственный,ссДок.Ответственный));
	Стк.Вставить("Организация",ссДок.Организация);
	Стк.Вставить("Контрагент",ссДок.Контрагент.НаименованиеПолное);
	Стк.Вставить("Договор",ссДок.Договор);
	Стк.Вставить("ФИООрг",Справочники.ФизическиеЛица.ФИОстр(ссДок.КонтролерСТК));
	Стк.Вставить("ФИОКа",СокрЛП(ссДок.Подписант));
	
	Если ЗначениеЗаполнено(Стк.Договор) Тогда
		Стк.Вставить("ЗаголовокДоговор","Договор : ");
	КонецЕСЛИ;
	
	
	//Стк.вставить("АдресОтправителя",Справочники.Контрагенты.ПолучитьЮрАдрес(Стк.Организация));
	//Стк.вставить("АдресПолучателя",Справочники.Контрагенты.ПолучитьЮрАдрес(Стк.Контрагент));
	
	
	Возврат Стк;
	
КонецФункции

Функция Данные(сс)

	Запрос =Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_РеестрыЗаказНаряды.Цена КАК Цена,
	               |	ро_РеестрыЗаказНаряды.ЗаказНаряд КАК ЗаказНаряд,
	               |	ISNULL(СпрИмяКАНом.НаименованиеКА,ро_РеестрыЗаказНаряды.Оборудование.Наименование) КАК Оборудование,
	               |	ро_РеестрыЗаказНаряды.Оборудование.Диаметр КАК Диаметр,
	               |	ро_РеестрыЗаказНаряды.Оборудование.Давление КАК Давление,
	               |	CASE WHEN ДокЗН.НомерОборудованияКор="""" THEN ДокЗН.НомерОборудования ELSE ДокЗН.НомерОборудованияКор END КАК НомерОборудования,
	               |	ДокЗН.Плательщик.Наименование КАК Плательщик,
	               |	ДокЗН.Производитель.Наименование КАК Производитель,
	               |	ДокЗН.Заключение.Наименование КАК Заключение,
	               |	ДокЗН.ДатаИспытания КАК ДатаИспытания,
	               |	CASE WHEN ДокЗН.ИнвНомерКор="""" THEN ДокЗН.ИнвНомер ELSE ДокЗН.ИнвНомерКор END КАК ИнвНомер,
	               |	ро_РеестрыЗаказНаряды.НомерЗаказНаряда КАК ЗаказНарядНомер,
	               |	1 КАК Кол,
	               |	ISNULL(СпрИмяКА.НаименованиеКА,ро_РеестрыЗаказНаряды.ЗаказНаряд.Оборудование.Родитель.Наименование) КАК Группа,
	               |	ро_РеестрыЗаказНаряды.ОписаниеПараметров КАК ОписаниеПараметров
	               |ИЗ
	               |	Документ.ро_Реестры.ЗаказНаряды КАК ро_РеестрыЗаказНаряды
				   |INNER JOIN Документ.ро_Реестры Док ON Док.ссылка = ро_РеестрыЗаказНаряды.ссылка
				   |
				   |INNER JOIN Документ.роЗаказНаряд ДокЗН ON ДокЗН.ссылка = ро_РеестрыЗаказНаряды.ЗаказНаряд
				   |
	               |LEFT OUTER JOIN Справочник.ро_Оборудование.НаименованиеДляКонтрагента СпрИмяКА ON СпрИмяКА.ссылка     = ДокЗН.Оборудование.Родитель
				   |                                                                                и СпрИмяКА.Контрагент = Док.контрагент
				   |
	               |LEFT OUTER JOIN Справочник.ро_Оборудование.НаименованиеДляКонтрагента СпрИмяКАНом ON СпрИмяКАНом.ссылка     = ДокЗН.Оборудование
				   |                                                                                   и СпрИмяКАНом.Контрагент = Док.контрагент
	               |LEFT OUTER JOIN Справочник.ро_Заключения СпрЗак ON СпрЗак.ссылка = ДокЗН.Заключение и СпрЗак.БезОплаты = истина
	               |
	               |ГДЕ
	               |	ро_РеестрыЗаказНаряды.Ссылка = &Ссылка
	               |  и СпрЗак.ссылка IS NULL
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Группа,
	               |	Оборудование";
	
	  Запрос.УстановитьПараметр("Ссылка",сс);
	  
	  Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДанныеРаботы(сс)

	Запрос =Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_РеестрыРаботы.Цена КАК Цена,
	               |	ро_РеестрыРаботы.ЗаказНаряд КАК ЗаказНаряд,
	               |	ро_РеестрыРаботы.РаботаПоПрайсу КАК РаботаПоПрайсу,
	               |	ро_РеестрыРаботы.Работа КАК Работа,
	               |	ро_РеестрыРаботы.Работа.ЕдиницаИзмерения КАК ЕдИзм,
	               |	ISNULL(СпрИмяКАНом.НаименованиеКА,ДокЗН.Оборудование.Наименование) КАК Оборудование,
	               |	ДокЗН.Оборудование.Диаметр КАК Диаметр,
	               |	ДокЗН.Оборудование.Давление КАК Давление,
	               |	CASE WHEN ДокЗН.НомерОборудованияКор="""" THEN ДокЗН.НомерОборудования ELSE ДокЗН.НомерОборудованияКор END КАК НомерОборудования,
	               |	CASE WHEN ДокЗН.ИнвНомерКор="""" THEN ДокЗН.ИнвНомер ELSE ДокЗН.ИнвНомерКор END КАК ИнвНомер,
	               |	ДокЗН.Номер КАК ЗаказНарядНомер,
	               |	ро_РеестрыРаботы.Количество КАК Количество
	               |ИЗ
	               |	Документ.ро_Реестры.Работы КАК ро_РеестрыРаботы
				   |INNER JOIN Документ.ро_Реестры Док ON Док.ссылка = ро_РеестрыРаботы.ссылка
				   |
				   |INNER JOIN Документ.роЗаказНаряд ДокЗН ON ДокЗН.ссылка = ро_РеестрыРаботы.ЗаказНаряд
	               |
	               |LEFT OUTER JOIN Справочник.ро_Оборудование.НаименованиеДляКонтрагента СпрИмяКА ON СпрИмяКА.ссылка     = ДокЗН.Оборудование.Родитель
				   |                                                                                и СпрИмяКА.Контрагент = Док.контрагент
				   |
	               |LEFT OUTER JOIN Справочник.ро_Оборудование.НаименованиеДляКонтрагента СпрИмяКАНом ON СпрИмяКАНом.ссылка     = ДокЗН.Оборудование
				   |                                                                                   и СпрИмяКАНом.Контрагент = Док.контрагент
	               |ГДЕ
	               |	ро_РеестрыРаботы.Ссылка = &Ссылка
	               |
	               |UNION ALL 
	               |
	               |ВЫБРАТЬ
	               |	ро_РеестрыЗаказНаряды.Цена КАК Цена,
	               |	ро_РеестрыЗаказНаряды.ЗаказНаряд КАК ЗаказНаряд,
	               |	ISNULL(СпрИмяКАНом.НаименованиеКА,ДокЗН.Оборудование.Наименование) КАК РаботаПоПрайсу,
	               |	неопределено КАК Работа,
	               |	ДокЗН.Оборудование.ЕдиницаИзмерения КАК ЕдИзм,
	               |	ISNULL(СпрИмяКАНом.НаименованиеКА,ДокЗН.Оборудование.Наименование) КАК Оборудование,
	               |	ДокЗН.Оборудование.Диаметр КАК Диаметр,
	               |	ДокЗН.Оборудование.Давление КАК Давление,
	               |	CASE WHEN ДокЗН.НомерОборудованияКор="""" THEN ДокЗН.НомерОборудования ELSE ДокЗН.НомерОборудованияКор END КАК НомерОборудования,
	               |	CASE WHEN ДокЗН.ИнвНомерКор="""" THEN ДокЗН.ИнвНомер ELSE ДокЗН.ИнвНомерКор END КАК ИнвНомер,
	               |	ДокЗН.Номер КАК ЗаказНарядНомер,
	               |	1 КАК Количество
	               |ИЗ
	               |	Документ.ро_Реестры.ЗаказНаряды КАК ро_РеестрыЗаказНаряды
				   |
				   |INNER JOIN Документ.ро_Реестры Док ON Док.ссылка = ро_РеестрыЗаказНаряды.ссылка
				   |
				   |INNER JOIN Документ.роЗаказНаряд ДокЗН ON ДокЗН.ссылка = ро_РеестрыЗаказНаряды.ЗаказНаряд
	               |
	               |LEFT OUTER JOIN Справочник.ро_Оборудование.НаименованиеДляКонтрагента СпрИмяКА ON СпрИмяКА.ссылка     = ДокЗН.Оборудование.Родитель
				   |                                                                                и СпрИмяКА.Контрагент = Док.контрагент
				   |
	               |LEFT OUTER JOIN Справочник.ро_Оборудование.НаименованиеДляКонтрагента СпрИмяКАНом ON СпрИмяКАНом.ссылка     = ДокЗН.Оборудование
				   |                                                                                   и СпрИмяКАНом.Контрагент = Док.контрагент
				   
	               |LEFT OUTER JOIN	Документ.ро_Реестры.Работы КАК ро_РеестрыРаботы ON  ро_РеестрыРаботы.заказНаряд = ро_РеестрыЗаказНаряды.ЗаказНаряд
				   
	               |ГДЕ
	               |	ро_РеестрыЗаказНаряды.Ссылка = &Ссылка
	               | и  ро_РеестрыРаботы.Ссылка IS NULL
	               |
	               |";
	
	  Запрос.УстановитьПараметр("Ссылка",сс);
	  
	  Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПечатьРеестр(сс) Экспорт
	
	Макет = Документы.ро_Реестры.ПолучитьМакет("Реестр");
	
	ТБл = Данные(сс);
	сткШапка = ДанныеШапка(сс);
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "роПечатьРеестр";
	Таб.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	Если Тбл.Количество()=0 ТОгда Возврат Таб; КонецЕсли;
	
	
	Обл = Макет.ПолучитьОбласть("Шапка");
	ОблТаб = Макет.ПолучитьОбласть("ШапкаТаб");
	Обл.Параметры.Заполнить(сткШапка);
	Таб.Вывести(Обл);
	
	
	ОблГр = Макет.ПолучитьОбласть("Группа");
	Обл   = Макет.ПолучитьОбласть("Строка");
	
	МАсОбл = Новый МАссив;
	МасОбл.Добавить(ОблГР);
	МасОбл.Добавить(Обл);
	
	Т = тбл.Скопировать();
	Т.свернуть("Группа,ОписаниеПараметров","Кол,Цена");
	Т.Сортировать("Группа,ОписаниеПараметров");
	Для каждого С из Т Цикл
		облГр.Параметры.Заполнить(С);
		
		Мас = Тбл.НайтиСтроки(Новый Структура("Группа,ОписаниеПараметров",С.Группа,с.ОписаниеПараметров));
		СткНом = Новый Структура("ном",0);
		Для каждого Стр из Мас Цикл
			сткНом.ном=сткНом.Ном+1;
			Обл.Параметры.Заполнить(Стр);
			Обл.Параметры.Заполнить(СткНом);
			Таб.Вывести(Обл);
			Если Таб.ПроверитьВывод(МасОбл)=Ложь Тогда
				Таб.ВывестиГоризонтальныйРазделительСтраниц();
				Таб.Вывести(облТаб);
			КонецЕСЛИ;
		КонецЦикла;
		
		Таб.Вывести(облГр);
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Итого");
	Обл.Параметры.Заполнить(сткШапка);
	Т.свернуть("","Кол,Цена");
	Обл.Параметры.Заполнить(Т[0]);
	
	
	Таб.Вывести(Обл);
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьГруппировки = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	
	Возврат Таб;
	
	
	
	
КонецФункции

Функция ПечатьРеестрСвод(сс,ссКА) Экспорт

	Макет = НайтиМакетРеестра(ссКА);
	МасКол = Справочники.ПечатныеФормы.ПолучитьМассивПараметров(Макет.ПолучитьОбласть("Строка"));
	
	СтрСвр = "";
	СтрСврНомОбр = "";
	СткНомОбр = Новый Структура;
	ЕстьНомОбр=Ложь;
	Для каждого эл из МасКол Цикл
		Если нрег(Эл)="кол" или нрег(Эл)="ном" или нрег(Эл)="сумма"  Тогда  Продолжить; КонецЕсли;
		СтрСвр = СтрСвр+","+Эл;
		
		
		Если  нрег(Эл)="номероборудованиясписок"
			или нрег(Эл)="заказнарядномерсписок"  Тогда
			ЕстьНомОбр = Истина;
		ИНаче
			СтрСврНомОбр = СтрСврНомОбр+","+Эл;
			СткНомОбр.Вставить(Эл);
		КонецЕсли;
		
	КонецЦикла;
	СтрСвр 		 = Сред(СтрСвр,2);
	СтрСврНомОбр = Сред(СтрСврНомОбр,2);
	
	сткШапка = ДанныеШапка(сс);
	Тбл = Данные(сс);
	
	
	Если  ЕстьНомОбр=Истина Тогда
		
		Тбл.Колонки.Добавить("НомерОборудованияСписок");
		Тбл.Колонки.Добавить("ЗаказНарядНомерСписок");
		
		Т = Тбл.Скопировать(,СтрСврНомОбр);
		Т.Свернуть(СтрСврНомОбр,"");
		Для каждого С из Т Цикл
			ЗаполнитьЗначенияСвойств(СткНомОбр,с);
			Мас = Тбл.НайтиСтроки(СткНомОбр);
			пСтр = "";
			пЗак = "";
			Для каждого Эл из Мас Цикл
				пСтр = пСтр + ", "+СокрлП(эл.НомерОборудования);
				пЗак = пЗак + ", "+СокрлП(эл.ЗаказНарядНомер);
			КонецЦикла;
			пСтр = Сред(пСтр,3);
			пЗак = Сред(пЗак,3);
			
			Для каждого Эл из Мас Цикл
				Эл.НомерОборудованияСписок = пСтр;
				Эл.ЗаказНарядНомерСписок = пЗак;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕСлИ;
	
	
	
	Тбл.Свернуть(СтрСвр,"Кол");
	Тбл.Колонки.Добавить("Сумма",Новый ОПисаниеТипов("Число"));
	
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "роПечатьРеестрСвод";
	Если Тбл.Количество()=0 ТОгда Возврат Таб; КонецЕсли;
	
	
	Обл = Макет.ПолучитьОбласть("Шапка");
	ОблТаб = Макет.ПолучитьОбласть("ШапкаТаб");
	Обл.Параметры.Заполнить(сткШапка);
	Таб.Вывести(Обл);
	
	
	Обл   = Макет.ПолучитьОбласть("Строка");
	
	СткНом = Новый Структура("ном",0);
	Для каждого Стр из Тбл Цикл
		Стр.Сумма = Стр.Цена * Стр.Кол;
		
		сткНом.ном=сткНом.Ном+1;
		Обл.Параметры.Заполнить(Стр);
		Обл.Параметры.Заполнить(СткНом);
		Таб.Вывести(Обл);
		
	КонецЦикла;
	
	ОблИтог = Макет.ПолучитьОбласть("Итого");
	ОблИтог.Параметры.Заполнить(сткШапка);
	Тбл.свернуть("","Кол,Сумма");
	ОблИтог.Параметры.Заполнить(Тбл[0]);
	Таб.Вывести(ОблИтог);
	
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьГруппировки = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	
	Возврат Таб;
	
	
КонецФункции	

Функция НайтиМакетРеестра(ссКА)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ TOP 1
	               |	КонтрагентыПечатныеФормы.ПечФорма КАК ПечФорма
	               |ИЗ
	               |	Справочник.Контрагенты.ПечатныеФормы КАК КонтрагентыПечатныеФормы
	               |ГДЕ
	               |	КонтрагентыПечатныеФормы.Ссылка = &Ссылка
	               |	И КонтрагентыПечатныеФормы.ИспользоватьВДокументах = Значение(Перечисление.ВидыДокументовДЛяПечФорм.Реестр) ";
	Запрос.УстановитьПараметр("Ссылка",ссКА);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		
		
		ДвоичныеДанные = Выб.Печформа.хрОбработкаПечати.Получить();
		Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
		Макет = Новый ТабличныйДокумент;
		Макет.Прочитать(Поток);
		Поток.Закрыть();
		
		Возврат Макет;
	КонецЕсли;
	
	Возврат  Документы.ро_Реестры.ПолучитьМакет("РеестрСвод");
	
КонецФункции

Функция ПечатьНакладная(Мас,Макет,ссПечФормы=Неопределено) Экспорт

	Возврат Справочники.ПечатныеФормы.ПечатьНакладная(Мас,Макет,ссПечФормы);
	
КонецФункции	

Функция ПечатьРеестрРабот(сс) Экспорт
	
	Макет = Документы.ро_Реестры.ПолучитьМакет("РеестрРабот");
	
	ТБл = ДанныеРаботы(сс);
	сткШапка = ДанныеШапка(сс);
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "роПечатьРеестр";
	Таб.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	Если Тбл.Количество()=0 ТОгда Возврат Таб; КонецЕсли;
	
	
	Обл = Макет.ПолучитьОбласть("Шапка");
	ОблТаб = Макет.ПолучитьОбласть("ШапкаТаб");
	Обл.Параметры.Заполнить(сткШапка);
	Таб.Вывести(Обл);
	
	
	ОблГр = Макет.ПолучитьОбласть("Группа");
	Обл   = Макет.ПолучитьОбласть("Строка");
	
	МАсОбл = Новый МАссив;
	МасОбл.Добавить(ОблГР);
	МасОбл.Добавить(Обл);
	
	Т = тбл.Скопировать();
	Т.свернуть("РаботаПоПрайсу,НомерОборудования,ИнвНомер","Количество,Цена");
	Т.Сортировать("РаботаПоПрайсу,НомерОборудования,ИнвНомер");
	СткНом = Новый Структура("ном,номс",0,0);
	Для каждого С из Т Цикл
		сткНом.ном=сткНом.Ном+1;
		облГр.Параметры.Заполнить(С);
		облГр.Параметры.Заполнить(сткНом);
		Таб.Вывести(облГр);
		
		Мас = Тбл.НайтиСтроки(Новый Структура("РаботаПоПрайсу,НомерОборудования,ИнвНомер",с.РаботаПоПрайсу,с.НомерОборудования,с.ИнвНомер));
		сткНом.номС=0;
		Для каждого Стр из Мас Цикл
			Если Стр.Работа = Неопределено Тогда ПродолжитЬ; КонецЕсли;
			сткНом.номС=сткНом.НомС+1;
			Обл.Параметры.Заполнить(Стр);
			Обл.Параметры.Заполнить(СткНом);
			Таб.Вывести(Обл);
			Если Таб.ПроверитьВывод(МасОбл)=Ложь Тогда
				Таб.ВывестиГоризонтальныйРазделительСтраниц();
				Таб.Вывести(облТаб);
			КонецЕСЛИ;
		КонецЦикла;
		
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Итого");
	Обл.Параметры.Заполнить(сткШапка);
	Т.свернуть("","Количество,Цена");
	Обл.Параметры.Заполнить(Т[0]);
	
	
	Таб.Вывести(Обл);
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьГруппировки = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	
	Возврат Таб;
	
	
	
КонецФункции

#КонецОбласти


Функция ПолучитьЦенуИзПрайса(Дт,КА,Обр) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |    ISNULL(Рег.Цена,0) Цена
	               |ИЗ
	               |	Справочник.ро_Оборудование Спр 
				   |LEFT OUTER JOIN РегистрСведений.Прайс.СрезПоследних(&Дт) Рег ON Рег.Контрагент = &КА
				   |                                           и Рег.Оборудование  = Спр.родитель 
				   |                                           и (Рег.ДиаметрОт   <= Спр.Диаметр  или Рег.ДиаметрОт = 0)
				   |                                           и (Рег.ДиаметрДо   >= Спр.Диаметр  или Рег.ДиаметрДо = 0)
				   |                                           и (Рег.ДавлениеОт  <= Спр.Давление или Рег.ДавлениеОт = 0)
				   |                                           и (Рег.ДавлениеДо  >= Спр.Давление или Рег.ДавлениеДо = 0)
				   |WHERE Спр.ссылка = &Обр
	               |";
	
	Запрос.УстановитьПараметр("Дт",Дт);
	Запрос.УстановитьПараметр("КА",КА);
	Запрос.УстановитьПараметр("Обр",Обр);
	
	Выб = Запрос.Выполнить().Выбрать();
	ЕСли Выб.Следующий() ТОгда
		Рез = Выб.Цена;
	Иначе
		Рез =Неопределено ;
	КонецЕСЛИ;
	
	Возврат Рез;
	
КонецФункции
